//// Общие рекомендации:
// Имя переменных, функций и т.д. должно быть информативным, лаконичным, запоминающимся и, по возможности, произносимым.
// Используйте осмысленные имена для глобальных переменных и короткие — для локальных.
// Полезно описание каждой глобальной переменной снабжать коротким комментарием:



http://megamozg.ru/post/6908/	// ООП
http://megamozg.ru/post/6910/	// ООП
http://appleinsider.ru/developer/razrabotka-pod-apple-shag-vtoroj.html	// Паттерн MVC
https://www.codecademy.com	// Code Academy